Dlubal.RFEM5.PartialActivityType
Type of partial activity

Dlubal.RFEM5.PartialActivityType.UnknownPartialActivityType
Unknown partial activity type

Dlubal.RFEM5.PartialActivityType.CompleteActivityType
Complete

Dlubal.RFEM5.PartialActivityType.FixedActivityType
Fixed from displacement/rotation

Dlubal.RFEM5.PartialActivityType.TearingActivityType
Tearing from force/moment

Dlubal.RFEM5.PartialActivityType.YieldingActivityType
Yielding from force/moment

Dlubal.RFEM5.PartialActivityType.FailureActivityType
Failure